README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-01 Mon 22:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CodeQL Dataflow SQL Injection (Go)</title>
<meta name="author" content="Michael Hohn" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CodeQL Dataflow SQL Injection (Go)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org28a0be9">1. Intro</a></li>
<li><a href="#org5e11c79">2. Build a CodeQL database</a></li>
<li><a href="#orgd43d296">3. Run the queries</a></li>
<li><a href="#orgbe1c530">4. Notes</a></li>
</ul>
</div>
</div>
<div id="outline-container-org28a0be9" class="outline-2">
<h2 id="org28a0be9"><span class="section-number-2">1.</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Minimal Go example to demonstrate taint flow: untrusted input from <code>stdin</code> flows into a dynamically constructed SQL string and is executed via <code>exec.Command("sqlite3", ...)</code>.</li>
<li>Two CodeQL queries are included:
<ul class="org-ul">
<li><code>SourceGetUserInfo.ql</code>: matches the return value of <code>getUserInfo()</code> as a taint source.</li>
<li><code>SinkExecCommandThirdArg.ql</code>: matches the 3rd argument of <code>exec.Command(...)</code> as a taint sink.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5e11c79" class="outline-2">
<h2 id="org5e11c79"><span class="section-number-2">2.</span> Build a CodeQL database</h2>
<div class="outline-text-2" id="text-2">
<p>
Assumes Go toolchain and CodeQL CLI are installed and on PATH.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #483d8b;">cd</span> codeql/codeql-dataflow-sql-injection-go

<span style="color: #b22222;"># </span><span style="color: #b22222;">Optional: fetch deps if any</span>
go mod init example.com/adduser 2&gt;/dev/null || true
go mod tidy 2&gt;/dev/null || true

<span style="color: #b22222;"># </span><span style="color: #b22222;">Create the CodeQL database (Go extractor auto-detected)</span>
codeql database create db --language=go --source-root .
</pre>
</div>

<p>
If you already have a database, you can skip creation and reuse it.
</p>
</div>
</div>
<div id="outline-container-orgd43d296" class="outline-2">
<h2 id="orgd43d296"><span class="section-number-2">3.</span> Run the queries</h2>
<div class="outline-text-2" id="text-3">
<p>
First, install the pack dependencies, then analyze the database with this pack.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #483d8b;">cd</span> codeql/codeql-dataflow-sql-injection-go

<span style="color: #b22222;"># </span><span style="color: #b22222;">Install dependencies for the pack</span>
codeql pack install

<span style="color: #b22222;"># </span><span style="color: #b22222;">Run both queries in this directory against the database</span>
codeql database analyze db . <span style="color: #8b2252;">\</span>
       --format=sarifv2.1.0 <span style="color: #8b2252;">\</span>
       --output=results.sarif
</pre>
</div>

<p>
To run a single query:
</p>

<div class="org-src-container">
<pre class="src src-shell">codeql database analyze db SourceGetUserInfo.ql --format=text
codeql database analyze db SinkExecCommandThirdArg.ql --format=text
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe1c530" class="outline-2">
<h2 id="orgbe1c530"><span class="section-number-2">4.</span> Notes</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>The queries use AST matching (not dataflow) to demonstrate precise source/sink identification. You can wire them into a taint configuration to perform full dataflow analysis.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michael Hohn</p>
<p class="date">Created: 2025-09-01 Mon 22:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
